@chcp 1251
@echo off
Title Сигнал о появлении в сети
mode con:cols=70 lines=14
cls
set /p PCName=Введите Hostname или IP: 
:1
ping -n 1 %PCName% >nul && msg * /W /time:999999 %PCName% появился в сети в %time%! && exit
cls
echo       _________ ________ ________ ___      ___ ___    ___ _________
echo      /\        \\       \\       \\  \    /\  \\  \  /\  \\        \
echo     /  \________\\_______\\_______\\__\  /  \__\\__\/  \__\\________\
echo    /   /  ___   //  _____//  _____//  / /   /  //  /   /  //  ______/
echo   /   /  /  /  //  /_\   /  /_\   /  / /   /  //   \  /  //  /____\
echo  /   /  /  /  //  ___/  /  ___/  /  / \   /  //  /\ \/  //  ______/
echo  \  /  /_\/  //  /  \  /  /  \  /  /___\ /  //  /\ \   //  /____\
echo   \/________//__/    \/__/    \/_______//__//__/  \/__//________/
echo    \\\\\\\\\\\\\\     \\\\     \\\\\\\\\\\\\\\\\   \\\\\\\\\\\\\\
echo.
echo              %PCName% не в сети. Попробуем снова...
timeout /T 10
goto 1
